# Parameter Type Id Dim Label Is Type Property

Source: https://www.revitapidocs.com/2026/fcc85b90-aa60-2b21-2623-cd996ea75b69.htm

---

| Parameter Type Id Dim Label Is Type Property |
| --- |

"Is Type Parameter"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId DimLabelIsType { get; }
```

```
Public Shared ReadOnly Property DimLabelIsType As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ DimLabelIsType {
	ForgeTypeId^ get ();
}
```

```
static member DimLabelIsType : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace